package com.sw.netty._04;

import io.netty.buffer.ByteBuf;
import io.netty.buffer.ByteBufAllocator;

import static utils.ByteBufferUtil.log;

/**
 * @author suaxi
 * @date 2026/07/09 22:52
 */
public class ByteBufSliceTest {
    public static void main(String[] args) {
        ByteBuf bf = ByteBufAllocator.DEFAULT.buffer(16);
        bf.writeBytes(new byte[]{'0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'a', 'b', 'd', 'c', 'd', 'e', 'f'});
        log(bf);
        // read index:0 write index:17 capacity:64
        //         +-------------------------------------------------+
        //         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
        // +--------+-------------------------------------------------+----------------+
        // |00000000| 30 31 32 33 34 35 36 37 38 39 61 62 64 63 64 65 |0123456789abdcde|
        // |00000010| 66                                              |f               |
        // +--------+-------------------------------------------------+----------------+

        // 切片（切片过程中不会发生数据的复制）
        ByteBuf bf1 = bf.slice(0, 5);
        log(bf1);
        // read index:0 write index:5 capacity:5
        //         +-------------------------------------------------+
        //         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
        // +--------+-------------------------------------------------+----------------+
        // |00000000| 30 31 32 33 34                                  |01234           |
        // +--------+-------------------------------------------------+----------------+
        bf1.retain();

        ByteBuf bf2 = bf.slice(5, 5);
        log(bf2);
        // read index:0 write index:5 capacity:5
        //         +-------------------------------------------------+
        //         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
        // +--------+-------------------------------------------------+----------------+
        // |00000000| 35 36 37 38 39                                  |56789           |
        // +--------+-------------------------------------------------+----------------+

        // 释放内存
        bf.release();

        System.out.println("ByteBuf 内存已释放");

        // 如果后续还要使用，需要显式 retain，防止计数器为0，内存被释放
        log(bf);
    }
}
